import React, { Component } from 'react';


class OtherDashboardItems extends Component {
    render() {
        return (
            <div>                
                <br/><br/>

                <div class="small-box bg-light text-light" style={{ padding: '10px' }}>

                    <h6 className="text-center">Testing and Quarantine Centers in Sri Lanka</h6>

                    <iframe src="https://www.google.com/maps/d/u/0/embed?mid=1PuiuCde9NbpdzHzlH3a-Mq2AaDGqMIg_" width="100%" height="480px"></iframe>
                    <table style={{ width: '100%' }}>
                        <tbody>
                            <tr>
                                <td align="center" style={{ backgroundColor: '#2196F3', width: '50%', color: 'white' }} > Testing Centers</td>
                                <td align="center" style={{ backgroundColor: 'red', width: '50%', color: 'white' }} > Quarantine Centers</td></tr></tbody></table>
                </div>

                <div>
                    <div className="small-box bg-light text-light">
                        <img width="100%" src="https://cdn.newsfirst.lk/english-uploads/2020/03/df84b558-contacts-mobile.jpg" />
                    </div>

                </div>



                <div className="small-box bg-light text-light">
                    <h6 className="text-center">Ministry of Health &amp; Indigenous Medical Services Guidelines</h6>
                    <br />
                    <h5><p align="center">
                        <a style={{ width: '90%' }} className="btn btn-success" data-toggle="collapse" href="#collapseExample" role="button" aria-expanded="false" aria-controls="collapseExample">
                            නිවසේ දීම නිරෝධායනය වීමට උපදෙස් 			</a>
                    </p></h5>
                    <br />
                    <div className="collapse" id="collapseExample">
                        <div className="card card-body">

                            <h6><strong>විදෙස්ගතව සිට පැමිණි පුද්ගලයින් නිවස තුළ ස්වයං නිරෝධායනයට ලක් වීමේදී අනුගමනය කළ යුතු මාර්ගෝපදේශයන් පහත පරිදි වේ.</strong></h6>
                            <p>1. විදෙස්ගතව සිට පැමිණි පුද්ගලයා නිවසේ වාතාශ්‍රය ලැබෙන කාමරයක වෙනම රඳවා තැබිය යුතු අතර නිවසේ අනෙකුත් සාමාජිකයින් ඔහුගෙන් වෙන් වී වෙනම කාමරවල සිටිය යුතු ය.</p> <p>2. නිරෝධායනයට ලක් වන පුද්ගලයා සහ පවුලේ අනෙකුත් සාමාජිකයින් අතර අවම වශයෙන් මීටරයක දුරස්තභාවයක් තබා ගත යුතු ය.</p> <p>3. නිවසේ අනෙකුත් සාමාජිකයින් වෙනම නානකාමරයක් භාවිත කිරීම වඩාත් ම සුදුසු වන අතර එසේ නොමැතිව එකම නානකාමරයක් භාවිත කරන්නේ නම්, නිරෝධායනය ලක් වන පුද්ගලයා නාන කාමරය භාවිත කිරීමෙන් පසු එහි සියලු උපකරණ පිරිසිදු කළ යුතු ය.</p> <p>4. නිවසට අමුත්තන් පැමිණීම සීමා කළ යුතු අතර කිසිදු අවස්ථාවක විදෙස්ගතව සිට පැමිණි පුද්ගලයා කිසිදු අමුත්තෙකුට මුණ නොගැස්විය යුතු ය.</p> <p>5. අවම වශයෙන් තත්පර 20ක් හොඳින් සබන් යොදා නිතර දෑත් පිරිසිදු කළ යුතු අතර ජලය යොදා දෑත් පිරිසිදු කිරීමට නොහැකි අවස්ථාවකදී මධ්‍යසාර අඩංගු දෑත් සේදීමේ සනීපාරක්ෂක ද්‍රාවණයක් භාවිත කරන්න.</p> <p>6. පිරිසිදු නොකළ දෑත්වලින් ඇස්,&nbsp;නහය සහ මුව ස්පර්ශ කිරීමෙන් වළකින්න.</p> <p>7. නිවස තුළ නිරෝධායනය ලක් වන පුද්ගලයා දිනකට දෙවරක් සිය ශරීර උෂ්ණත්වය පරීක්ෂා කළ යුතු අතර යම් හෙයකින් උණ, කැස්ස, ශ්වසන අපහසුතා, උගුරේ අමාරුව, ඇඟපත වේදනා වැනි රෝග ලක්ෂණ පෙන්නුම් කරන්නේ&nbsp;නම්, වහාම ප්‍රදේශයේ සෞඛ්‍ය වෛද්‍ය නිලධාරිවරයා (MOH) හෝ මහජන සෞඛ්‍ය පරීක්ෂකවරයා (PHI) දැනුම්වත් කළ යුතු ය.</p> <p>8. ඉවත දැමිය හැකි මුඛ ආවරණ, අත්වැසුම් භාවිත කිරීමෙන් පසු ඒවා නැවත භාවිත නොකර සුදුසු පරිදි විනාශ කළ යුතු ය.</p> <p>9. නිරෝධායනයට ලක් කෙරෙන පුද්ගලයාගේ පිගාන්, කොප්ප, වැනි ආහාර ගැනීමට භාවිත කරන උපකරණ ඇතුළු අනෙකුත් සියලු උපකරණ වෙන් කර තැබිය යුතු ය.</p> <p>10. ගේ දොර උපකරණ, ඇඳ ඇතිරිලි සහ ඇඳුම් භාවිත කිරීමෙන් පසු සබන් යොදා හොඳින් පිරිසිදු කළ යුතු වේ.&nbsp;</p>
                            <h6><strong>සක්‍රිය සෞඛ්‍ය නිලධාරීන්ගේ අධීක්ෂණය යටතේ ස්වයං නිරීක්ෂණයට ලක්වීම</strong></h6>
                            <p>1. නිරෝධායනයට ලක් වන පුද්ගලයින් සම්බන්ධයෙන් පසු විපරම් කිරීම හා ක්ෂේත්‍ර පරීක්ෂාව සම්බන්ධයෙන් ප්‍රදේශයේ සෞඛ්‍ය වෛද්‍ය නිලධාරීවරයා වගකිව යුුතු වේ.</p> <p>2. සෞඛ්‍ය වෛද්‍ය නිලධාරිවරයා විසින් පත්කරනු ලබන මහජන සෞඛ්‍ය පරීක්ෂකවරයා නිරෝධායනයට ලක් වන පුද්ගලයින් නිරන්තරව නිරීක්ෂණයට ලක් කරනු ඇති.</p> <p>3. නිරෝධායනයට ලක් කෙරෙන දින 14 ඇතුළත සෞඛ්‍ය වෛද්‍ය නිලධාරිවරයා විසින් ස්ථාන පරීක්ෂාවෙන්, දුරකතනය සහ කෙටි පණිවුඩ ඔස්සේ,&nbsp; අදාළ පුද්ගලයාගේ සෞඛ්‍ය තත්ත්වය නිරීක්ෂණය කරනු ලබයි.</p> <p>4. යම් හෙයකින් නිරෝධායනයට ලක් වන පුද්ගලයෙකු රෝග ලක්ෂණ පෙන්නුම් කරන්නේ නම්, මහජන සෞඛ්‍ය පරීක්ෂකවරයා කඩිනමින් ඒ පිළිබඳව සෞඛ්‍ය වෛද්‍ය නිලධාරිවරයා සහ ප්‍රාදේශීය වසංගත රෝග විශේෂඥවරයා දැනුම්වත් කළ යුතු වේ.</p> <p>5. රෝග ලක්ෂණ පෙන්නුම් කරන අදාළ පුද්ගලයා 1990 සුවසැරිය ගිලන් රථ&nbsp; සේවය ඇමතීමෙන් ළඟම රජයේ රෝහලට හෝ කොරෝනා ආසාදිතයින්ට ප්‍රතිකාර කිරිම සඳහා නියම කරන ලද රෝහලකට ඇතුළත් කළ යුතු ය.&nbsp;</p>				</div>
                    </div>
                </div>
            </div>
        );
    }
}

export default OtherDashboardItems;